fun main(){
    print("\t Целочисленные  типы переменных \n" +
            "Byte: хранит целое число от -128 до 127 и занимает 1 байт \n" +
            "Short: хранит целое число от -32 768 до 32 767 и занимает 2 байта\n" +
            "Int: хранит целое число от -2 147 483 648 (-231) до 2 147 483 647 (231 - 1) и занимает 4 байта\n" +
            "Long: хранит целое число от –9 223 372 036 854 775 808 (-263) до 9 223 372 036 854 775 807 (263-1) и занимает 8 байт \n" +
            "UByte: хранит целое число от 0 до 255 и занимает 1 байт \n" +
            "UShort: хранит целое число от 0 до 65 535 и занимает 2 байта \n" +
            "UInt: хранит целое число от 0 до 232 - 1 и занимает 4 байта \n" +
            "ULong: хранит целое число от 0 до 264-1 и занимает 8 байт \n" +
            "\t Числа с плавающей точкой\n" +
            "Float: хранит число с плавающей точкой от -3.4*1038 до 3.4*1038 и занимает 4 байта\n" +
            "Double: хранит число с плавающей точкой от ±5.0*10-324 до ±1.7*10308 и занимает 8 байта.\n" +
            "\t Логический тип Boolean\n" +
            "Тип Boolean может хранить одно из двух значений: true (истина) или false (ложь).\n" +
            "\t Символы\n" +
            "Символьные данные представлены типом Char. Он представляет отдельный символ, который заключается в одинарные кавычки.\n" +
            "\t Строки\n" +
            "Строки представлены типом String. Строка представляет последовательность символов, заключенную в двойные кавычки, либо в тройные двойные кавычки.\n" +
            "\t Тип Any\n" +
            "Kotlin также есть тип Any, который позволяет присвоить переменной данного типа любое значение:")
}