package Практиув_3

fun main(){
    println("Введите четырех значное число")
    var nabm= readln().toInt()
    println("Введите число а")
    var a= readln().toInt()
    if (nabm<10000 && nabm>999){
        if((nabm/1000+(nabm-((nabm/1000)*1000))/100)==((nabm-((nabm/1000)*1000))%100)/10+((nabm-((nabm/1000)*1000))%100)%10){
            println("Сумма двух первых его цифр равна сумме двух его последних цифр")
        }
        if (((nabm/1000+(nabm-((nabm/1000)*1000))/100)+((nabm-((nabm/1000)*1000))%100)/10+((nabm-((nabm/1000)*1000))%100)%10)%3==0){
            println("Сумма ваших цифр делится на 3")
        }
        if (((nabm/1000*(nabm-((nabm/1000)*1000))/100)*((nabm-((nabm/1000)*1000))%100)/10*((nabm-((nabm/1000)*1000))%100)%10)%4==0){
            println("Произведение ваших цифр делится на 4")
        }
        if (((nabm/1000*(nabm-((nabm/1000)*1000))/100)*((nabm-((nabm/1000)*1000))%100)/10*((nabm-((nabm/1000)*1000))%100)%10)%a==0){
            println("Произведение ваших цифр делится на $a")
        }
    }
    else{
        println("Вы ввели не четырех значное число")
    }
}